-- phpMyAdmin SQL Dump
-- version 4.6.3
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Jul 19, 2016 at 11:45 PM
-- Server version: 5.5.49-0ubuntu0.14.04.1
-- PHP Version: 5.5.9-1ubuntu4.17

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `fn`
--

-- --------------------------------------------------------

--
-- Table structure for table `category`
--

CREATE TABLE `category` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `category`
--

INSERT INTO `category` (`id`, `name`) VALUES
(3, 'IT'),
(1, 'Էկոնոմիկա'),
(2, 'Քաղաքականություն');

-- --------------------------------------------------------

--
-- Table structure for table `news`
--

CREATE TABLE `news` (
  `id` int(10) UNSIGNED NOT NULL,
  `date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `title` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_mysql500_ci NOT NULL,
  `content` varchar(5000) NOT NULL,
  `category_id` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `news`
--

INSERT INTO `news` (`id`, `date`, `title`, `content`, `category_id`) VALUES
(1, '2016-07-18 01:12:07', 'Վերին Լարսի անցակետում Արցախի քաղաքացի է մահացել', 'Վերին Լարսի անցակետում այսօր՝ հուլիսի 18-ին, Արցախի Հանրապետության քաղաքացի է մահացել:\r\n\r\nՀՀ արտակարգ իրավիճակների նախարարության մամուլի ծառայությունից NEWS.am-ին հայտնեցին, որ քաղաքացին մահացել է հերթի մեջ, նախնական տվյալով՝ ինֆարկտից:\r\n\r\nՀիշեցնենք, որ տեղումների հետեւանքով հունիսի 23-ին փլուզվել էր Լարսի ավտոճանապարհի մի հատվածը, ինչի հետեւանքով անցակետը փակ էր  մինչեւ հուլիսի 6-ը: Դրանից հետո ցերեկային ժամերին ճանապարհը բացվում է, իսկ երեկոյան՝ որոշ օրերին՝ 18:00-ին, որոշ օրերին՝ 20:00-ին փակվում:', 2),
(2, '2016-07-18 01:44:53', 'Ալմաթիում ահաբեկչական սպառնալիքի կարմիր մակարդակ է սահմանվել', 'Ղազախստանի Ալմաթի քաղաքում տեղական ժամանակով ժամը 12։20-ից ահաբեկչական սպառնալիքի կարմիր մակարդակ է սահմանվել, հայտնում է Tengrinews–ը՝ վկայակոչելով ՆԳՆ քաղաքի դեպարտամենտի  մամուլի ծառայությունը։\r\n\r\nՀաղորդվում է, որ այս կապակցությամբ ոստիկանները քաղաքի բնակիչներին կոչ են անում պահպանել պահանջները։\r\n\r\nԿարմիր մակարդակ սահմանելուց հետո իրավապահներն իրավունք են ստանում զննել մարդկանց անձնական իրերը, մեքենաները, ընդհուպ մինչեւ արգելափակել երթեւեկությունը։ Ուժային կառույցներին թույլ է տրվում անարգել մտնել բնակելի տներ եւ այլ հաստատություններ։\r\n\r\nՀիշեցնենք, որ Ալմաթիում ներքին գործերի վարչության շենքի մոտ հրաձգություն է տեղի ունեցել: Սոցցանցերի օգտատերերի վկայությամբ՝ «սեւ հագուստով անհայտ անձը կրակ է արձակել ոստիկանության ուղղությամբ, փորձել մեքենա կանգնեցնել, իսկ հետո փախել արեւելյան ուղղությամբ»:', 2),
(3, '2016-07-18 01:33:29', 'Հուլիսի 7-ին ժամանակավորապես կդադարեցվի գազամատակարարումը Ստեփանակերտ քաղաքի հետևյալ հասցեներում', 'Ներմիացման և ձմեռային նախապատրաստական աշխատանքների  իրականացման նպատակով ս.թ.-ի հուլիսի 7-ին՝ ժամը 9:00-17:00,  ժամանակավորապես կդադարեցվի Ստեփանակերտ քաղաքի հետևյալ փողոցներին հարող շենքերի և հիմնարկ-ձեռնարկությունների գազամատակարարումը.   Ստեփ ԳԷՍ,  Բաղրամյան 17,19, 19/1, 21, 21ա, 23, 29 Առուշանով, Արշակ Տեր Ղուկասով, Հակոբ Մելիքով, Ուլուբաբյան առք 3, 4  Ուլուբաբյան նրբանցք 3 Ուլուբաբյան փակուղի 1ա Գ. Սևունց, Փաշաև', 1),
(10, '2016-07-18 04:30:09', 'Armenia StartUp Cup 2016-ն արդեն ընդունում է հայտեր', 'Armenia StartUp Cup ազգային աԱռաջնությունն արդեն ընդունում է գրանցման հայտեր: Այս տարի այն անցկացվում է Երևանում, Գյումրիում, Վանաձորում, Դիլիջանում և Ստեփանակերտում: Բիզնես մոդելի դիմումները ընդունվում են հուլիսի 1-ից մինչև հուլիսի 31-ը www.Armenia.startupcup.com/submit կայքում:\r\n\r\nԱռաջնության շրջանակներում մրցող ձեռներեցները հնարավորություն կունենան իրենց գաղափարը դարձնելու գործուն բիզնես մոդել: Պարտադիր չէ, որ մրցույթին մասնակցող ձեռներեցները փորձագետներ լինեն, ովքեր փայլուն փաստաթղթեր են պատրաստում կամ հաշվարկներ կատարում:', 3),
(11, '2016-07-17 21:13:18', 'Հաջողության պատմություն. Արամ Փախչանյան` «Այբ» դպրոցի տնօրեն, ABBYY ընկերության փոխնախագահ (մաս 2)', 'Սմարթֆոնը` ArmPhone, iPhone 6\r\nՍիրելի հավելվածները` Lingvo բառարան\r\nՀաճախ օգտագործվող սոցցանցը` Facebook\r\nՀաջողության բանաձևը` անել այն, ինչին պատրաստ ես նվիրվել\r\n\r\nՀայկական ստարտափերի թույլ ու ուժեղ կողմերը, բիզնես մենեջմենթի սխալներն ու մարդկային ռեսուրսների կառավարման բացթողումները: Ո՞րն է եղել «Այբ» դպրոցի տնօրեն, ABBYY ընկերության փոխնախագահ Արամ Փախչանյանի ամենատպավորիչ հաղթանակը: Ինչպես  ինտրավերտ ֆիզիկոսը վերածվեց հաջողակ ղեկավարի: Այս մասին է ittrend.am-ի բացառիկ հարցազրույցի երկրորդ մասը:\r\n\r\nԱռաջին մասը կարդացեք այստեղ:\r\nՉկա հաջողություն, որին չեն նախորդել անհաջողություններ\r\n\r\nՀաջողությունը միշտ անհաջողություններով անցած ճանապարհն է: Մարդկանց փոխում է ոչ թե հաջողությունը, այլ անհաջողությունները: Ինձ կերտել են հենց անհաջողությունները` տալով ինձ նոր գիտելիքներ, հմտություններ:\r\n\r\nIMG_9240\r\n\r\nԻնչը ստիպեց ինձ փոխվել\r\n\r\nԼինելով ֆիզիկայի ֆակուլտետի ուսանող` ես բավականին ինտրավերտ անձնավորություն էի` ներփակված իմ հետաքրքրությունների ու ներաշխարհի մեջ: Սակայն աշխատանքի բերումով ստիպված եղա շփվել ռուս չինովնիկների ու մեծ ընկերությունների հոռացած ղեկավարների հետ… Դժվար էր, ես երիտասարդ էի և պետք էր կապեր հաստատել, հեղինակություն դառնալ նրանց աչքերում, ովքեր շատ տարբեր էին ինձնից աշխարհայացքով, կյանքի մոտեցումներով և օգտագործվող ալկոհոլի քանակով…\r\n\r\nԵրկրորդ բանը, որ ստիպեց ինձ փոխվել, մեծ քանակությամբ մարդկանց ղեկավար դառնալն էր, ովքեր տարբեր ազգերից ու մշակույթներից էին: Տարվա կեսն անցնում էր ինքնաթիռներում` հաճախորդների ու աշխատակիցների հետ հանդիպելու նպատակով: Սովորեցի ճանաչել չինացիներին, ճապոնացիներին, ամերիկացիներին, եվրոպացիներին, բանակցել նրանց հետ, վստահություն ներշչնել: Բիզնեսում կարևոր են ոչ թե վաճառողի հմտությունները, այլ որպես մասնագետ վստահություն ստեղծելը:\r\n\r\nՀաղթանակ, որի համը դեռ բերանումս է\r\n\r\nԱմերիկյան ընկերություններից մեկը արտոնագրային վեճի շուրջ դատի էր տվել ABBYY ընկերությանը, այդ գործը սկսվեց 2007-ին  և շարունակվեց մինչև 2013-ը: Եկավ դատավարության օրը, որին մենք պատրաստվել էինք 1 տարուց ավելի, և դատարանի վճիռը ոչ հօգուտ մեզ կարող էր բերել ABBYY-ի լուծարմանը: Այդ օրը երդվյալ ատենակալների առաջ ելույթ ունեցա, պատասխանեցի հարցերին, ինձ թվաց, որ ելույթս լավն էր: Սակայն դուրս եկա դահլիճից ու այլևս չեմ հիշում ինչ տեղի ունեցավ հետո… Ներսս դատարկ էր, այրված էի, որևէ բան չէի զգում: Գնացինք Սան-Ֆրանցիսկոյում տեղի ունեցող տարվա ամենամեծ միջոցառմանը մասնակցելու, որտեղ նավեր էին մրցում: Բոլորը ուրախանում էին, ծափահարում, իսկ ես անհաղորդ կանգնած նայում էի…\r\n\r\nԵրկու օրից միայն իմացանք, որ հաղթել ենք դատը: Արդեն երեք տարի է անցել, բայց այդ հաղթանակի համը դեռ բերանումս է: Դրան մենք սպասում էինք 5 տարի, պատրաստվում 1 տարուց ավելի, սովորում հանգիստ պատասխանել մեղադրող կողմի դատապաշտպանի հարցերին, գիտեինք, որ մի սայթաքում, ու ամեն ինչ` մեր այսքան տարիների տանջանքը, կորած է: Պետք է ժպտաս, ձայնդ պետք է չփոխվի, որպեսզի կասկած չհարուցես: Թեև մենք մեղավոր չէինք, բայց հակառակորդը նպատակ էր դրել ոչնչացնել մեզ:\r\n\r\nԱյդ փորձառությունը սովորեցրեց ինձ հանգիստ մնալ նույնիսկ այն պայմաններում, երբ փորձում են տրամաբանությամբ կամ այլ հնարքներով հավասարակշռությունից հանել քեզ:\r\n\r\nIMG_9236\r\n\r\nՍխալներ, որոնք անում են հայկական ստարտափները\r\n\r\nՇատ լավ է, որ ստարտափները շատացել են, սակայն նկատում եմ, որ դա նորաձևության նման մի բան է դառնում. ստարտափ հաճախ ստեղծում են ` ուղղակի ստեղծելու համար: Հաճախ հանդիպում եմ թիմերի, որոնք որոշել են ստարտափ ստեղծել և նոր միայն մտածում են գաղափարի շուրջ: Վերջերս մի տղա մոտեցավ Ամերիկյան համալսարանում, ասաց, որ ստարտափ է ուզում ստեղծել, և մի քանի գաղափար ունի, հարցնում էր` դրանցից ո՞րը լավ կաշխատի: Դա սխալ մոտեցում է. ստարտափը պետք է առաջանա գաղափարից, ոչ թե հակառակը:\r\n\r\nՇատ ստարտափներ խուսափում են մեծ շուկաներից և թիրախային շուկան ընտրում են Հայաստանը: Դա այնքան էլ լավ միտք չէ: Հայկական շուկան ոչ միայն փոքր է, այլև յուրահատուկ և շատ հարցերում հետ է ընկել համաշխարհային զարգացումներից: Օրինակ` Հայաստանում մինչ օրս չկա որակյալ ինտերնետային առևտուր: Բայց կան երկրներ, որտեղ խանութները փակվում են:\r\n\r\nԱյստեղ մարդիկ գրասենյակ բացելիս դեռ սերվերներ են գնում և տեղադրում, իսկ, օրինակ, Շվեդիայում նույնիսկ ամենամեծ ընկերությունները վաղուց անցել են ամպային լուծումներին և ոչ մի սերվեր չեն պահում: Միայն հայկական շուկան հաշվի առնող ստարտափը կարող է կարճ ժամանակ հետո ունենալ հնացած լուծում: Կարևոր է հենց առաջին պահից համեմատել քեզ գլոբալ խաղացողների հետ:', 3),
(12, '2016-07-18 18:18:32', 'Հանքավանում ընթանում է տեխնոլոգիական ճամբար 600 դպրոցականների համար', 'Հուլիսի 11-25-ը Հանքավանում անցկացվում է ամառային տեխնոլոգիական ճամբար 9-13 տարեկան 600 դպրոցականների համար: Ճամբարին մասնակցում են Վորլդ Վիժն Հայաստանի շահառու համայնքների անապահով ընտանիքների երեխաներն ու մարզերի «Արմաթ» ինժերական լաբորատորիաների սաները:\r\n\r\nՍտեղծարար և ակտիվ հանգստի պայմաններում համախմբված դպրոցականները կիսվում են ինժեներական հմտություններով, յուրացնում նոր գիտելիքներ ու խրախուսում միմյանց: Երեխաները մասնավորապես սովորում են ծրագրավորել գծին հետևող ռոբոտ: Բացի այդ` թիմային աշխատանքի միջոցով նրանք նոր եռաչափ տպիչներեն ստեղծում Արցախի դպրոցների համար:\r\n\r\nՏեխնոլոգիական ճամբարի մասնակիցները սովորում են նաև ազգային պարեր և ակտիվորեն մասնակցում հայրենաճանաչությանն ուղղված արշավների:\r\n\r\nԱմառային ճամբարն իրականացվում է Վորլդ Վիժն Հայաստանի, Ucom ընկերության և Ինֆորմացիոն տեխնոլոգիաների ձեռնարկությունների միության կողմից:', 3);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `category`
--
ALTER TABLE `category`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `idx_category_name` (`name`);

--
-- Indexes for table `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_category_id` (`category_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `category`
--
ALTER TABLE `category`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
--
-- AUTO_INCREMENT for table `news`
--
ALTER TABLE `news`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;
--
-- Constraints for dumped tables
--

--
-- Constraints for table `news`
--
ALTER TABLE `news`
  ADD CONSTRAINT `fk_category_id` FOREIGN KEY (`category_id`) REFERENCES `category` (`id`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
